Autodesk.Revit.DB.ElementIntersectsElementFilter.GetElement
Gets the target element.
Returns:
The element.
Since:
2012

Autodesk.Revit.DB.ElementIntersectsElementFilter.#ctor(Autodesk.Revit.DB.Element,System.Boolean)
Constructs a filter to match elements which intersect the given element, with the
option to match all elements not intersecting the given element.
element:
The element to check for intersection.
inverted:
True if the filter should match all elements which do not intersect the given
element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category of the element is not supported for element intersection filters.
-or-
The element is not supported for element intersection filters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementIntersectsElementFilter.#ctor(Autodesk.Revit.DB.Element)
Constructs a filter to match elements which intersect the given element.
element:
The element to check for intersection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category of the element is not supported for element intersection filters.
-or-
The element is not supported for element intersection filters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementIntersectsElementFilter
A filter to find elements that intersect the solid geometry of a given element.
Remarks:
The target object is another element. The intersection is determined with the same logic used by Revit
to determine if an interference exists during generation of an Interference Report. (This means that some
combinations of elements will never be detected as intersecting by this filter, such as concrete members which are automatically
joined at their intersections). Also, elements which have no solid geometry, such as Rebar, will never be detected
as intersecting by this filter.
This filter is a slow filter.
Slow filters require that the Element be obtained and expanded in memory first.
Thus it is preferable to couple this filter with at least one ElementQuickFilter,
which should minimize the number of Elements that are expanded.
Since:
2012